src_ext/Reports/УЗ_ВедомостьПоКассеДляМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>УЗ_ВедомостьПоКассеДляМенеджеров</Name>
		</Properties>
	</Report>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_Касса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_Касса</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Reports/УЗ_ВедомостьПоКассеДляМенеджеров/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьТЗОстатков()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КассаОстаткиИОбороты.Касса КАК Касса,
	|	КассаОстаткиИОбороты.Регистратор КАК Регистратор,
	|	КассаОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	КассаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	КассаОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	|	КассаОстаткиИОбороты.СуммаРасход КАК СуммаРасход
	|ИЗ
	|	РегистрНакопления.УЗ_Касса.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Регистратор, Движения, Касса В (&Касса))
	|		КАК КассаОстаткиИОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Касса,
	|	Регистратор
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Касса", Касса);

	Если Не ЗначениеЗаполнено(Касса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,", Касса В (&Касса)","");
	КонецЕсли;

	ТЗ = Запрос.Выполнить().Выгрузить();

	Возврат ТЗ;

КонецФункции

&НаСервере
Функция ПолучитьИтогоТЗОстатков()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КассаОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	КассаОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	КассаОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	|	КассаОстаткиИОбороты.СуммаРасход КАК СуммаРасход
	|ИЗ
	|	РегистрНакопления.УЗ_Касса.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, , , Касса В (&Касса)) КАК
	|		КассаОстаткиИОбороты";
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Касса", Касса);

	Если Не ЗначениеЗаполнено(Касса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,", Касса В (&Касса)","");
	КонецЕсли;

	ТЗ = Запрос.Выполнить().Выгрузить();

	Возврат ТЗ;

КонецФункции

&НаСервере
Процедура СформироватьНаСервере()

	Если Не ЗначениеЗаполнено(Период.ДатаНачала) И Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		УстановитьПериодПоУмолчанию();
	КонецЕсли;

	//скользящий запрет (Настройки → Даты запрета изменения) ограничивает и просмотр
	ГраницаПросмотра = УЗ_ДатыЗапрета.ГраницаПросмотра();
	Если ЗначениеЗаполнено(ГраницаПросмотра) И Период.ДатаНачала < ГраницаПросмотра Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =
			СтрШаблон(НСтр("ru = 'Документы ранее %1 вам смотреть нельзя (Настройки → Даты запрета изменения).'"),
			Формат(ГраницаПросмотра, "ДЛФ=D"));
		Сообщение.Поле = "Период";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	ТабДок = Новый  ТабличныйДокумент;
	Макет   = Отчеты.УЗ_ВедомостьПоКассеДляМенеджеров.ПолучитьМакет("Макет");
	ОбластьШапка 					= Макет.ПолучитьОбласть("Шапка");
	ОбластьГруппировкаКасса 		= Макет.ПолучитьОбласть("ГруппировкаКасса");
	ОбластьСтрока 					= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги 					= Макет.ПолучитьОбласть("Итоги");

	Остатки			= ПолучитьТЗОстатков();
	ИтогоОстатки	= ПолучитьИтогоТЗОстатков();

	ТЗИтогиКасса = Остатки.Скопировать();
	ТЗИтогиКасса.Свернуть("Касса","СуммаНачальныйОстаток, СуммаКонечныйОстаток, СуммаПриход, СуммаРасход");
	ТЗИтогиКасса.Сортировать("Касса");

	ОбластьШапка.Параметры.ДатаНачала = Формат(Период.ДатаНачала,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаОкончания = Формат(КонецДня(Период.ДатаОкончания),"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка,1);

	Если ИтогоОстатки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОбластьИтоги.Параметры.Заполнить(ИтогоОстатки[0]);
	ТабДок.Вывести(ОбластьИтоги,2);

	ТабДок.НачатьАвтогруппировкуСтрок();
	Для Каждого СтрКассы Из ТЗИтогиКасса Цикл

		ОстаткиПоКассе  = РегистрыНакопления.УЗ_Касса;
		Фильтр   = Новый Структура;
		Фильтр.Вставить("Касса",СтрКассы.Касса);
		ТабОстатковНаНачало = ОстаткиПоКассе.Остатки(Период.ДатаНачала,Фильтр,
		"Касса", "Сумма");
		ТабОстатковНаКонец = ОстаткиПоКассе.Остатки(КонецДня(Период.ДатаОкончания),Фильтр,
		"Касса", "Сумма");

		//Вывод заголовка по Кассе
		НайденнаяСтрока = ТЗИтогиКасса.Найти(СтрКассы.Касса, "Касса");
		ОбластьГруппировкаКасса.Параметры.Заполнить(НайденнаяСтрока);
		Если ТабОстатковНаНачало.Количество()>0 Тогда
			ОбластьГруппировкаКасса.Параметры.СуммаНачальныйОстаток = ТабОстатковНаНачало[0].Сумма;
		Иначе
			ОбластьГруппировкаКасса.Параметры.СуммаНачальныйОстаток = 0;
		КонецЕсли;
		Если ТабОстатковНаКонец.Количество()>0 Тогда
			ОбластьГруппировкаКасса.Параметры.СуммаКонечныйОстаток = ТабОстатковНаКонец.Итог("Сумма");
		Иначе
			ОбластьГруппировкаКасса.Параметры.СуммаКонечныйОстаток = 0;
		КонецЕсли;

		ТабДок.Вывести(ОбластьГруппировкаКасса,3);

		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Касса", СтрКассы.Касса);
		НайденныеСтроки = Остатки.НайтиСтроки(ПараметрыОтбора);

		Сч1 = 0;
		Для Каждого Стр из НайденныеСтроки Цикл
			Сч1 = Сч1 + 1;
			ОбластьСтрока.Параметры.Заполнить(Стр);
			ОбластьСтрока.Параметры.НомерСтроки = Сч1;
			ТабДок.Вывести(ОбластьСтрока,4);
		КонецЦикла;

	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();

	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.Защита              = Истина;
	ТабДок.ТолькоПросмотр      = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ФиксацияСверху = 4;
	ТабДок.ФиксацияСлева = 8;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	ОтображениеСостояния = Элементы.ТабДок.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	// картинки «длительная операция» в платформе нет (ДлительнаяОперация48 — картинка БСП) — только текст
	ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");

	СформироватьНаСервере();

	Элементы.ТабДок.ОтображениеСостояния.Видимость      = Ложь;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьПериодПоУмолчанию();

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	УстановитьПериодПоУмолчанию();

КонецПроцедуры

//Пустой период (новая форма, пустые сохранённые настройки) — текущий месяц; начало не раньше
//границы просмотра (Настройки → Даты запрета изменения). Без конца — до конца месяца начала.
&НаСервере
Процедура УстановитьПериодПоУмолчанию()

	Если Не ЗначениеЗаполнено(Период.ДатаНачала) И Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	КонецЕсли;
	ГраницаПросмотра = УЗ_ДатыЗапрета.ГраницаПросмотра();
	Начало = Период.ДатаНачала;
	Окончание = Период.ДатаОкончания;
	Если ЗначениеЗаполнено(ГраницаПросмотра) И Начало < ГраницаПросмотра Тогда
		Начало = ГраницаПросмотра;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Окончание) Или Окончание < Начало Тогда
		Окончание = КонецМесяца(Макс(Начало, ТекущаяДатаСеанса()));
	КонецЕсли;
	Если Начало <> Период.ДатаНачала Или Окончание <> Период.ДатаОкончания Тогда
		Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Период.ДатаНачала = Начало;
		Период.ДатаОкончания = Окончание;
	КонецЕсли;

КонецПроцедуры
